###################################################################

# Created by write_sdc on Sat Feb 12 23:24:58 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[31]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[30]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[29]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[28]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[27]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[26]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[25]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[24]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[23]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[22]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[21]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[20]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[19]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[18]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[17]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[16]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[15]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[14]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[13]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[12]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[11]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[10]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[9]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[8]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[7]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[6]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[5]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[4]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[3]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[2]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[1]}]
set_load -pin_load 3.40189 [get_ports {DATA_ADDRESS[0]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[31]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[30]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[29]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[28]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[27]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[26]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[25]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[24]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[23]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[22]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[21]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[20]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[19]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[18]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[17]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[16]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[15]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[14]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[13]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[12]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[11]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[10]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[9]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[8]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[7]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[6]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[5]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[4]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[3]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[2]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[1]}]
set_load -pin_load 3.40189 [get_ports {DATA_WRITE[0]}]
set_load -pin_load 3.40189 [get_ports DATA_WRITE_EN]
set_load -pin_load 3.40189 [get_ports DATA_READ_EN]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[31]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[30]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[29]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[28]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[27]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[26]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[25]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[24]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[23]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[22]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[21]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[20]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[19]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[18]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[17]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[16]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[15]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[14]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[13]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[12]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[11]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[10]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[9]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[8]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[7]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[6]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[5]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[4]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[3]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[2]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[1]}]
set_load -pin_load 3.40189 [get_ports {IR_ADDRESS[0]}]
create_clock [get_ports CLK]  -name MY_CLK  -period 3.55  -waveform {0 1.775}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports RST]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_READ[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_ADDRESS[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DATA_WRITE[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports DATA_WRITE_EN]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports DATA_READ_EN]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IR_ADDRESS[0]}]
